# -*- coding: utf-8 -*-

print "닭을 세어봅니다."
# 문자열 닭을 세어봅니다. 를 출력하라

print "암탉", 25 + 30 / 6 # 30을 6으로 나누어 내림한 것을 25에 더하고 앎탁 문자열과 한칸 띄워 출력
print "수탉" , 100 -25 * 3 % 4 # 25에 3을 곱한 것을 4로 나누었을 때의 나머지를 100에서 빼고 수탉과 한칸 띄워 출력

print "이제 달걀도 세어 봅시다." # 이제 달걀도 세어 봅시다. 를 출력

print 3 + 2 + 1 - 5 + 4 % 2 - 1.0 / 8.0 + 6 #4를 2로 나눈 나머지 계산, 1을 4로 나누어 내림한 값을 계산하고, + - 사칙연산한 '값'을 출력

print "3 + 2 < 5 - 7는 참인가요?" # 3 + 2 < 5 - 7는 참인가요? 문자열을 출력
print 3 + 2 < 5 - 7 # 부등호의 참, 거짓여부를 계산 후 앞의 것이 less than 뒤의 것 인지 보고 맞으면 True값 출력/ 틀리면False출력

print "3 + 2는 얼마죠?", 3 + 2 #앞의 문자열 그리고 한칸 띄어쓰기하여 3+2의 계산 결과값을 문자열로서 출력
print "5 - 7은 얼마죠?", 5 - 7 #위와 동일

print "아하 이게 FALSE인 이유네요."

print "더 해볼까요."

print "더 큰가요?", 5 > -2 #문자열 + 불린값을 전체를 문자열인 것으로 간주하여 한칸 띄워쓰기 하여 출력
print "더 크거나 같나요?", 5 >= -2 #위와 동일
print "더 작거나 같나요?", 5 <= -2 #위와 동일